Repository: gheyret/english2uyghur
Catalog: xfce-uyghur.tmx
Source language: en_us
Languages: ug

source: The folder permissions will be reset to a consistent state. Only users allowed to read the contents of this folder will be allowed to enter the folder afterwards.
ug: قىسقۇچ ھوقۇقلىرى نورمال ھالەتكە ئەسلىگە قايتۇرۇلىدۇ. ئىشلەتكۈچىلەرلا قىسقۇچتىكى مەزمۇنلارنى ئوقۇيالايدۇ ۋە ئىچىگە كىرەلەيدۇ.

source: The folders will be put at the top of the list
ug: مۇندەرىجە تىزىمنىڭ باش قىسمىغا قويۇلىدۇ

source: The following TYPEs are supported for the --launch command:
ug: تۆۋەندىكى TYPE لارنى --launch بۇيرۇقىدا ئىشلەتكىلى بولىدۇ:

source: The following TYPEs are supported for the --launch command: WebBrowser - The preferred Web Browser. MailReader - The preferred Mail Reader. FileManager - The preferred File Manager. TerminalEmulator - The preferred Terminal Emulator.
ug: --launch command دا تۆۋەندىكى تىپلارنى ئىشلەتكىلى بولىدۇ: WebBrowser - ئامراق توركۆرگۈ. MailReader - ئامراق ئېلخەت ئوقۇغۇ. FileManager - ئامراق ھۆججەت باشقۇرغۇ. TerminalEmulator - ئامراق تېرمىنال تەقلىدلىگۈ.

source: The following command parameters will be substituted when launching the action:
ug: مەشغۇلات ئىجرا بولغاندا تۆۋەندىكى بۇيرۇق پارامېتىرلىرى ئەمەلىي نەرسىلەرگە ئايلىنىدۇ.

source: The following devices were found:
ug: تۆۋەندىكى ئۈسكۈنىلەر تېپىلدى:

source: The following errors occured:
ug: تۆۋەندىكىدەك خاتالىق كۆرۈلدى:

source: The following monitor is detected:
ug: تۆۋەندىكى كۆزەتكۈچلەر بايقالدى:

source: The font family used to display fixed-width text
ug: تېكىستلەرنى تەڭ كەڭلىكتە كۆرسىتىدىغان فونت

source: The font size used to display fixed-width text
ug: تېكىستلەرنى تەڭ كەڭلىكتە كۆرسىتىدىغان فونتنىڭ چوڭلۇقى

source: The format describes the date and time parts to insert into the file name. For example, %Y will be substituted with the year, %m with the month and %d with the day. See the documentation of the date utility for additional information.
ug: ھۆججەت ئاتىدا ئىشلىتىدىغان چېسلا ۋە ۋاقىتنىڭ پىچىمىنى بەلگىلەپ بېرىدۇ. مەسىلەن: يىل %Y بىلەن، ئاي %m بىلەن، كۈن %d بىلەن ئىپادىلىنىدۇ. تېخىمۇ تەپسىلىي ئۇچۇرلارنى بىلمەكچى بولسىڭىز date بۇيرۇقىنىڭ قوللانمىسىغا قاراڭ.

source: The format describes the date and time parts to insert into the panel. For example, %Y will be substituted with the year, %m with the month and %d with the day. See the documentation of the date utility for additional information.
ug: ھۆججەت ئاتىدا ئىشلىتىدىغان چېسلا ۋە ۋاقىتنىڭ پىچىمىنى بەلگىلەپ بېرىدۇ. مەسىلەن: يىل %Y بىلەن، ئاي %m بىلەن، كۈن %d بىلەن ئىپادىلىنىدۇ. تېخىمۇ تەپسىلىي ئۇچۇرلارنى بىلمەكچى بولسىڭىز date بۇيرۇقىنىڭ قوللانمىسىغا قاراڭ.

source: The generic name of the entry, for example "Web Browser" in case of Firefox.
ug: كىرگۈنىڭ ئادەتتىكى ئاتىدۇر. مەسىلەن Firefox نىڭ ئاتى"توركۆرگۈ" بولىدۇ.

source: The group "%s" has been modified on the disk
ug: گۇرۇپپا «%s» دىسكىدا ئۆزگەرتىلىپتۇ

source: The gstreamer transcoder uses the gstreamer library for creating audio compositions. Essentially all audio files should be supported given that the correct plugins are installed. If an audio file is not recognized, make sure that you have the 'good','bad', and 'ugly' gstreamer plugin packages installed.
ug: ئۈن دىسكىسى ياساشتا ئىشلىتىلىدىغان gstreamer دېگەن كود ئالماشتۇرغۇچ gstreamer ئامبىرىنى تەلەپ قىلىدۇ. ئادەتتە مۇۋاپىق قىستۇرما ئورنىتىلسىلا، ئاساسەن بارلىق ئۈن ھۆججەتلىرىنى ئىشلىتىشكە بولىدۇ. ئەگەر ئۈن ھۆججەتلىرىنى تونۇماي قالسا، GStreamer نىڭ ياخشى(good)، ناچار(bad), قاملاشمىغان(ugly) دېگەن قىستۇرمىلىرى ئورنىتىلدىمۇ يوق تەكشۈرۈپ كۆرۈڭ.

source: The history couldn't be loaded: %s
ug: ئىزلارنى ئوقۇغىلى بولمىدى: %s

source: The icon size for the path entry
ug: يول كىرگۈسىنىڭ سىنبەلگە چوڭلۇقى

source: The icon to render.
ug: كۆرسىتىدىغان سىنبەلگە

source: The inserted disc is already blank.
ug: سالغان دىسكا قۇرۇق ئىكەن.

source: The inserted volume was mounted automatically
ug: سېلىنغان دىسكا ئۆزلۈكىدىن ئېگەرلەندى

source: The interface name
ug: ئېغىز ئاتى

source: The interface packets/bytes statistics
ug: ئېغىز بوغچا/بايت ستاتىستىكىسى

source: The interface state
ug: ئېغىز ھالىتى

source: The invalid characters are: %s
ug: تېكىست ئىناۋەتسىز: %s

source: The language and timezone are not revealed to websites.
ug: تىل ۋە ۋاقىت رايونى تورتۇراغا ئاشكارىلانمايدۇ.

source: The last active output must not be disabled, the system would be unusable.
ug: ئەڭ ئاخىرقى ئاكتىپ چىقىرىشنى ئىناۋەتسىز قىلىشقا بولمايدۇ. بولمىسا سىستېمىنى ئىشلەتكىلى بولمايدۇ.

source: The layout mode
ug: Layout ھالىتى

source: The libxfce4ui, libxfcegui4, libxfce4util, thunar-vfs and exo packages are distributed under the terms of the GNU Library General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ug: بۇ بوغچىلار(ibxfce4ui، libxfcegui4، libxfce4util، thunar-vfs ۋە exo) ئەركىن يۇمشاق دېتال فوندىنىڭ GNU Library General Public License دېگەن ئىجازەتنامىسىنىڭ ئىككىنچى نەشرىنىڭ ياكى كېيىنكى نەشرلىرىنىڭ ماددىلىرى بويىچە تارقىتىلدى.

source: The list of applications in the failsafe session is empty.
ug: بىخەتەر ئەڭگىمە(failsafe session) ئىچىدىكى پروگرامما تىزىمى قۇرۇق.

source: The location and the format of the autostart directory has changed. The new location is %s where you can place .desktop files to, that describe the applications to start when you login to your Xfce desktop. The files in your old autostart directory have been successfully migrated to the new location. You should delete this directory now.
ug: autostart مۇندەرىجىسىنىڭ ئورنى ۋە فورماتى ئۆزگەرتىلىپتۇ. يېڭى ئورنى %s بۇ يەرگە .desktop ھۆججىتىنى قويۇشقا بولىدۇ. بۇ ھۆججەتتە پروگراممىغا مۇناسىۋەتلىك چۈشەندۈرۈشلەر بار. كونا autostart مۇندەرىجىسىدىكى ھۆججەتلەر يېڭى ئورۇنغا كۆچۈرۈلۈپ. بولدى. ئەمدى بۇ مۇندەرىجىنى ئۆچۈرۈۋەتسىڭىز بولىدۇ.

source: The mailwatch applet cannot be added to the panel.
ug: ئېلخەت كۆزەتكۈنى كۆزنەككە قوشقىلى بولمىدى.

source: The maximum number of days to save cookies for
ug: Cookie نىڭ ئەڭ ئۇزۇن ساقلىنىش ۋاقتى

source: The maximum number of days to save the history for
ug: ئىزنىڭ ئەڭ ئۇزۇن ساقلىنىش ۋاقتى

source: The maximum pointer speed after acceleration
ug: تېزلىتىلگەندىن كېيىنكى چاشقىنەك ئىسترېلكىسىنىڭ ئەڭ چوڭ تېزلىكى

source: The maximum size of cached pages on disk
ug: دىسكىدىكى غەملەنگەن بەتلەرنىڭ ئەڭ چوڭ چوڭلۇقى

source: The minimum font size used to display text
ug: تېكىستلەرنى كۆرسىتىدىغان فونتنىڭ ئەڭ كىچىك چوڭلۇقى

source: The model for the icon view
ug: سىنبەلگە كۆرسىتىش ئۈچۈن ئىشلىتىدىغان مودېل

source: The mouse pointer cannot move farther than this distance between two clicks for them to be considered a double click
ug: ئىككى قېتىم چېكىلگەندە چاشقىنەك ئىسترېلكىسىنىڭ يۆتكەلگەن ئارىلىقى بۇ قىممەتتىن(پىكسېل) كىچىك بولسا، قوش چېكىش دەپ قارىلىدۇ.

source: The name "%s" is invalid.
ug: «%s» دېگەن ئات ئىناۋەتسىز.

source: The name %s is already in use
ug: %s دېگەن ئات ئىشلىتىلىۋېتىپتۇ

source: The name of the action that will be displayed in the context menu.
ug: مەزمۇن تىزىملىكىدە كۆرۈنىدىغان مەشغۇلاتنىڭ ئاتى.

source: The new value to set for the property
ug: خاسلىقنىڭ يېڭى قىممىتى

source: The notification area lost selection
ug: ئۇقتۇرۇش رايونى تاللانمىدى

source: The number of pixels the pointer must move before a drag operation will start
ug: چاشقىنەك ئىسترېلكىسىنىڭ يۆتكىلىش ئارىلىقى بۇ قىممەتتىن چوڭ بولسا سۆرەش دەپ قارىلىدۇ.

source: The number of pixels the pointer must move in a short time before it starts accelerating
ug: چاشقىنەك ئىسترېلكىسىنىڭ قىسقا ۋاقىت ئىچىدىكى يۆتكىلىش ئارىلىقى بۇ قىممەتتىن چوڭ بولسا، تېزلىنىش باشلىنىدۇ

source: The number of source and target filenames must be the same
ug: مەنبە ۋە نىشاندىكى ھۆججەت ئاتلىرىنىڭ سانى ئوخشاش بولۇشى كېرەك.

source: The orientation of the iconbar
ug: سىنبەلگە بالدىقىنىڭ يۆنىلىشى

source: The orientation of the tray.
ug: قوندۇرمىنىڭ يۆنىلىشى.

source: The packages thunar, xfce4-appfinder, xfce4-panel, xfce4-session, xfce4-settings, xfce-utils, xfconf, xfdesktop and xfwm4 are distributed under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
ug: بۇ بوغچىلار(thunar، xfce4-appfinder، xfce4-panel، xfce4-session، xfce4-settings، xfce-utils، xfconf، xfdesktop ۋە xfwm4) ئەركىن يۇمشاق دېتال فوندىنىڭ GNU General Public License دېگەن ئىجازەتنامىسىنىڭ ئىككىنچى نەشرىنىڭ ياكى كېيىنكى نەشرلىرىنىڭ ماددىلىرى بويىچە تارقىتىلدى.

source: The page '%s' couldn't be loaded.
ug: بەت ‹%s› نى ئوقۇغىلى بولمىدى.

source: The panel and plugin configurations will be permanently removed
ug: كۆزنەك ۋە قىستۇرما سەپلىمىلىرى مەڭگۈلۈككە ئۆچۈرۈلىدۇ

source: The panel of the Xfce Desktop Environment
ug: Xfce ئىجادىيەت مۇھىتى كۆزنىكى

source: The password for the user above
ug: ئىشلەتكۈچىنىڭ ئىمى

source: The path "%s" does not refer to a directory
ug: يول «%s» كۆرسەتكەن مۇندەرىجە مەۋجۇت ئەمەس

source: The pattern is always anchored within the special characters ^$
ug: مەزكۇر ئەندىزىگە ئالاھىدە ھەرپ ^$ ھەمىشە قوللىنىلىدۇ

source: The plugin restarted more than once in the last %d seconds. If you press Execute the panel will try to restart the plugin otherwise it will be permanently removed from the panel.
ug: قىستۇرما يېقىنقى %d سېكۇنت ئىچىدە بىر قانچە قېتىم قايتا قوزغىتىلدى. «ئىجرا قىل» نى باسسىڭىز قىستۇرمىنى قايتا قوزغىتىپ باقىدۇ، بولمىسا كۆزنەكتىن پۈتۈنلەي ئۆچۈرۈلىدۇ.

source: The preferred File Manager will be used to browse the contents of folders.
ug: بېكىتىلگەن ئامراق ھۆججەت باشقۇرغۇ، مۇندەرىجىلەرنىڭ مەزمۇنىنى كۆرۈشكە ئىشلىتىلىدۇ.

source: The preferred Mail Client will be used to compose emails when you click on E-mail addresses.
ug: ئېلخەت ئادرېسىنى چەككەندە ئېلخەت يېزىش ئۈچۈن ئىشلىتىلىدىغان ئامراق خەت خېرىدارى

source: The preferred Mail Reader will be used to compose emails when you click on email addresses.
ug: بېكىتىلگەن ئامراق خەت ئوقۇغۇ، ئېلخەت ئادرېسىنى چەككەندە ئېلخەت يېزىشقا ئىشلىتىلىدۇ.

source: The preferred Terminal Emulator will be used to run commands that require a CLI environment.
ug: بېكىتىلگەن ئامراق تېرمىنال تەقلىدلىگۈ CLI مۇھىتىدا بۇيرۇقلارنى ئىجرا قىلىشقا ئىشلىتىلىدۇ.

source: The preferred Web Browser will be used to open hyperlinks and display help contents.
ug: بېكىتىلگەن ئامراق توركۆرگۈ، ئۇلانمىلارنى ئېچىش، ياردەملەرنى كۆرسىتىشتە ئىشلىتىلىدۇ.

source: The preferred Web Browser will be used to open hyperlinks.
ug: ئۇلانمىلارنى ئېچىشتا ئىشلىتىدىغان ئامراق توركۆرگۈ.

source: The previous configuration will be restored in %i seconds if you do not reply to this question.
ug: ئەگەر بۇنىڭغا جاۋاب بەرمىسىڭىز بۇرۇنقى سەپلىمە %i سېكۇنت ئىچىدە ئەسلىگە كېلىدۇ.

source: The previous configuration will be restored in 10 seconds if you do not reply to this question.
ug: بۇنىڭغا جاۋاب بەرمىسىڭىز بۇرۇنقى سەپلىمە 10 سېكۇنت ئىچىدە ئەسلىگە كېلىدۇ.

source: The program to execute, possibly with arguments.
ug: ئىجرا قىلىدىغان پروگراممىدا پارامېتىرلارمۇ بار.

source: The property name can only be empty or "/" if a recursive reset was specified
ug: ئەگەر چوڭقۇرلار ئەسلىگە قايتۇرۇش بېكىتىلگەن بولسا، خاسلىق ئاتى قۇرۇق ياكى "/" بولۇشى كېرەك.

source: The property to query/modify
ug: سۈرۈشتۈرۈش/تۈزىتىش خاسلىقى

source: The ramp used to reach maximum pointer speed
ug: چاشقىنەك ئىسترېلكىسىنىڭ ئەڭ چوڭ تېزلىككە يېتىشكۈچە بولغان ئارىلىقتىكى تېزلىنىشى

source: The rate at which keystrokes are generated while a key is pressed
ug: كۇنۇپكا بېسىلىپ تۇرغان ۋاقىتتا، كۇنۇپكا كودىنىڭ ھاسىل قىلىنىش تېزلىكى

source: The root element ('/') is not a valid property name
ug: root ئېلېمېنت ('/') ئىناۋەتلىك خاسلىق ئاتى ئەمەس

source: The root folder has no parent
ug: root مۇندەرىجىسىنىڭ ئاتا مۇندەرىجىسى يوق

source: The root for all user-specific data files. By default this is set to <filename role="directory">~/.local/share/</filename>.
ug: ئىشلەتكۈچىگە تەۋە بارلىق سانلىق-مەلۇماتلارنىڭ غول يولى. كۆڭۈلدىكى قىممىتى <filename role="directory">~/.local/share/</filename>.

source: The saved states of your applications will not be restored during your next login.
ug: پروگراممىنىڭ ساقلانغان ھالىتى كېيىنكى قېتىم كىرگەندە ئەسلىگە كەلتۈرۈلمەيدۇ.

source: The search URL is empty. Please check your preferences.
ug: ئىزدەش ئۈچۈن ئىشلىتىلىدىغان URL ئىكەن. تەڭشىكىڭىزنى تەكشۈرۈپ كۆرۈڭ.

source: The search engines couldn't be loaded. %s
ug: ئىزدەش ماتورىنى ئوقۇغىلى بولمىدى. %s

source: The search engines couldn't be saved. %s
ug: ئىزدەش ماتورىنى ساقلىغىنى بولمىدى. %s

source: The selected application is used to open this and other files of type "%s".
ug: تاللانغان پروگرامما ئارقىلىق مەزكۇر ھۆججەت ۋە كېڭەيتمە نامى «%s» بولغان ھۆججەتلەرنى ئېچىشقا بولىدۇ

source: The selected directory (%s) for the new notes path already contains files. You must select or create an empty directory.
ug: تاللانغان يېڭى نوتېس (Notes) مۇندەرىجىسى(%s) نىڭدا ھۆججەتلەر بار ئىكەن. قۇرۇق مۇندەرىجىنى كۆرسىتىپ بېرىڭ ياكى يېڭىدىن ياساڭ.

source: The selected files could not be deleted
ug: تاللانغان ھۆججەتنى ئۆچۈرگىلى بولمىدى

source: The selected files could not be moved to the trash
ug: تاللانغان ھۆججەتنى ئەخلەتخانىغا تاشلىغىلى بولمىدى

source: The selected files could not be trashed
ug: تاللانغان ھۆججەتنى ئەخلەتخانىغا تاشلىغىلى بولمىدى

source: The selected image does not fit on the inserted disc
ug: تاللانغان تەسۋىر ھازىرقى دىسكىغا پاتمايدىكەن

source: The selection mode
ug: تاللاش ھالىتى

source: The server doesn't offer any databases.
ug: مۇلازىمېتىردا ھېچقانداق ساندان يوق.

source: The server is not ready.
ug: مۇلازىمېتىر تەييار ئەمەس.

source: The server rejected the connection.
ug: مۇلازىمېتىر باغلىنىشنى رەت قىلدى.

source: The session couldn't be loaded: %s
ug: ئەڭگىمەنى ئوقۇغىلى بولمىدى: %s

source: The session couldn't be saved. %s
ug: ئەڭگىمەنى ساقلىغىلى بولمىدى. %s

source: The signing certificate authority is not known.
ug: ئىمزالىق گۇۋاھنامە تارقاتقۇچى ئېنىق ئەمەس.

source: The size of the icon to render in pixels.
ug: كۆرسىتىدىغان سىنبەلگىنىڭ چوڭلۇقى(بىرلىكى پىكسېل)

source: The specified directory is not valid
ug: كۆرسىتىلگەن مۇندەرىجە ئىناۋەتسىز

source: The specified failsafe session ("%s") is not marked as a failsafe session.
ug: كۆرسىتىلگەن بىخەتەر ئەڭگىمە(failsafe session) («%s») تېخى بىخەتەر ئەڭگىمە(failsafe session) قىلىپ تەڭشەلمىگەن.

source: The stream is taking too much time to load
ug: ئېقىمنى ئوقۇش ئوقۇش ئۈچۈن نۇرغۇن ۋاقىت كېتىدۇ

source: The style of the toolbar
ug: قورال بالدىقىنىڭ ئۇسلۇبىنى بەلگىلەيدۇ

source: The sun never rises today.
ug: بۈگۈن كۈن چىقمايدۇ.

source: The sun never sets today.
ug: بۈگۈن كۈن ئولتۇرمايدۇ.

source: The sun rises at %s and sets at %s.
ug: كۈن %s دە چىقىپ، %s دە ئولتۇرىدۇ.

source: The syfs path of the newly added device
ug: يېڭىدىن قوشۇلغان ئۈسكۈنىنىڭ syfs يولى

source: The system defaults will be restored next time you log in.
ug: سىستېمىنىڭ كۆڭۈلدىكى قىممەتلىرى كېيىنكى قېتىم سىستېمىغا كىرگەندە ئەسلىگە قايتىدۇ.

source: The text of the label
ug: تېكىستنىڭ ئەنى

source: The thumbnail bar can be automatically hidden when the window is fullscreen.
ug: سىستېما تولۇق ئېكران ھالىتىدە بولغاندا كىچىك سۈرەتلەر ئاپتوماتىك يوشۇرۇنىدۇ.

source: The thumbnailer service is shutting down
ug: كىچىك سۈرەت ياسىغۇچ مۇلازىمىتى توختىتىلىۋاتىدۇ

source: The thumbnailer-service can not be reached, for this reason, the thumbnails can not be created. Install <b>Tumbler</b> or another <i>thumbnailing daemon</i> to resolve this issue.
ug: كىچىك سۈرەت مۇلازىمىتى بىلەن ئالاقە قىلالمىدى، شۇڭا كىچىك سۈرەتلەر ياسالمايدۇ بۇ مەسىلىنى ھەل قىلىش ئۈچۈن <b>Tumbler</b> ياكى <i>thumbnailing مۇئەككىلى</i> نى ئورنىتىڭ.

source: The time period an individual image is displayed during a slideshow (in seconds)
ug: تام تەسۋىرى سۈپىتىدە كۆرسىتىلگەندە، سۈرەتنىڭ كۆرسىتىلىش ۋاقتى(مىللىي سېكۇنت)

source: The time will appear in a tooltip.
ug: ۋاقىت كۆرسەتمىدە كۆرۈنىدۇ.

source: The time, in milliseconds, before a pressed key begins repeating
ug: كۇنۇپكا بېسىلىپ، تەكرارلىق ھاسىل قىلىنغۇچە بولغان ۋاقىت(مىللىسېكۇنت)

source: The time, in milliseconds, between repeated motion events
ug: كۇنۇپكا بېسىلىپ تۇرغاندا تەكرار مەشغۇلاتنى ئېلىپ بېرىش ئىنتېرۋالى(مىللىسېكۇنت ms)

source: The time, in milliseconds, between the initial key press and first repeated motion event
ug: كۇنۇپكا تۈننى قېتىم بېسىلىپ، ئۈزلۈكسىز بېسىلىپ تۇرۇۋاتىدۇ دەپ ھۆكۈم قىلىنغۇچە بولغان ۋاقىت(مىللىسېكۇنت ms)

source: The time, in milliseconds, to get to maximum speed
ug: ئەڭ يورۇقى تېزلىككە يېتىشكە كېرەك بولىدىغان ۋاقىت (ms)

source: The title of the screenshot, it will be used when displaying the screenshot on ZimageZ
ug: ئېكران كۆرۈنۈشىنىڭ ماۋزۇسىنى يېزىڭ. بۇ ZimageZ دا ئېكران كۆرۈنۈشىنى كۆرسەتكەندە ئىشلىتىلىدۇ

source: The transfers will be cancelled if Midori quits.
ug: مىدورى(Midori) ئاخىرلاشتۇرۇلسا ئۇزىتىشلار ئۈزۈلىدۇ.

source: The trash couldn't be loaded: %s
ug: ئەخلەت ساندۇقىنى ئوقۇغىلى بولمىدى: %s

source: The trash couldn't be saved. %s
ug: ئەخلەتنى ساقلىغىلى بولمىدى. %s

source: The type attribute of <value> cannot be an array
ug: <value> نىڭ تىپ خاسلىقى تىزىق بولسا بولمايدۇ

source: The user visible name of the renamer
ug: ئات ئۆزگەرتكۈچى renamer قىستۇرمىسىنىڭ كۆرسىتىلىدىغان ئاتى

source: The volume "%s" was mounted automatically
ug: بۇ دىسكا «%s» ئۆزلۈكىدىن ئېگەرلەندى

source: The width used for each item
ug: ھەر بىر تۈردە ئىشلىتىلىدىغان كەڭلىك

source: The window of Xfce4 Screenshooter
ug: Xfce4 ئېكران كۆرۈنۈشىنى سۈرەتكە ئالغۇ(Screenshooter) نىڭ كۆزنىكى

source: The window of Xfce4 Screenshooter after taking a screenshot
ug: سۈرەتكە ئېلىنىش تاماملانغاندىن كېيىنكى Xfce4 ئېكران كۆرۈنۈشىنى سۈرەتكە ئالغۇ(Screenshooter) نىڭ كۆزنىكى

source: The window title cannot be removed
ug: كۆزنەك ماۋزۇسىنى يۆتكىگىلى بولمايدۇ

source: The window to embed must match all of the non-blank criteria. Leave everything blank to rely on a launch command with socket ID.
ug: سىڭدۈرمەكچى بولغان كۆزنەك قۇرۇق بولمىغان بارلىق ئۆلچەمگە ماس كېلىشى كېرەك. سوكېت كىملىكى(ID) نى ئىشلىتىپ ئىجرا قىلىش ئۈچۈن، ھەممىسى قۇرۇق قالدۇرۇلسا بولىدۇ.

source: The working directory for the program.
ug: پروگراممىنىڭ خىزمەت مۇندەرىجىسىنى كۆرسىتىدۇ.

source: The working directory must be an absolute path
ug: خىزمەت مۇندەرىجىسى مۇتلەق يول بىلەن كۆرسىتىلىشى كېرەك

source: The write mode is not supported currently.
ug: ھازىرچە بۇ يېزىش ئۇسۇلىنى ئىشلەتكىلى بولمايدۇ.

source: Theme
ug: ئۆرنەك

source: Theme File Error
ug: ئۇسلۇب ھۆججىتى خاتا

source: There are %d new values, but only %d types could be determined
ug: جەمئىي %d قىممەت بار، بىراق ئاران %d سىنىڭ تىپىنى ئېنىقلىغىلى بولدى

source: There are no unvisited tabs
ug: زىيارەت قىلىنمىغان بەتكۈچ يوق

source: There are photos on the card. Would you like to add these photos to your album?
ug: كارتىدا سۈرەتلەر بار ئىكەن. بۇ سۈرەتلەرنى ئالبومغا قوشامسىز؟

source: There is already a running instance
ug: ئىجرا بولۇۋاتقان ئۈلگە مەۋجۇت

source: There is data that needs to be written to the device "%s" before it can be removed. Please do not remove the media or disconnect the drive
ug: ئۈسكۈنە «%s» چىقىرىشتىن بۇرۇن بىر يېزىشقا تېگىشلىك سانلىق-مەلۇماتلار بار.دىسكىنى چىقارماق ياكى ئۈسكۈنىنى كومپيۇتېردىن ئايرىۋەتمەڭ.

source: There is no device with the sysfs path "%s"
ug: بۇ يەردە sysfs يولى «%s» بولغان ئۈسكۈنە يوق

source: There is not enough free space to download "%s".
ug: «%s» نى چۈشۈرۈشكە يېتەرلىك بوشلۇق يوق.

source: There is not enough space available on the inserted disc.
ug: دىسكىدا يېتەرلىك بوشلۇق يوق ئىكەن.

source: There is not enough space on the destination. Try to remove files to make space.
ug: نىشاندا يېتەرلىك بوشلۇق يوق. بوشلۇق بىكارلاش ئۈچۈن بىر قىسىم ھۆججەتلەرنى يۆتكەڭ.

source: There is nothing on the clipboard to paste
ug: چاپلاش تاختىسىدا چاپلىغۇدەك نەرسە يوق

source: There seems to be no Verve D-BUS provider (e.g. the Verve panel plugin) running.
ug: Verve D-BUSprovider يوقتەك قىلىدۇ (مەسىلەن: Verve تاختا قىستۇرمىسى) ئىجرا قىلىنمىغاندەك قىلىدۇ.

source: There was an error connecting to the VNC server
ug: VNC مۇلازىمېتىرىغا باغلىنىشتا خاتالىق كۆرۈلدى

source: There was an error displaying help: %s
ug: ياردەمنى كۆرسىتىشتە خاتالىق كۆرۈلدى: %s

source: These applications are a part of the currently-running session, and can be saved when you log out. Changes below will only take effect when the session is saved.
ug: بۇ پروگراممىلار ھازىرقى ئەڭگىمەنىڭ بىر قىسمىدۇر. سىستېمىدىن چىققان چاغدا ساقلىۋېلىشقا بولىدۇ. تۆۋەندىكى ئۆزگىرىشلەر ئەڭگىمەدىلا ئاندىن كۈچكە ئىگە بولىدۇ.

source: These options may cause some applications to behave incorrectly. They are only here to allow you to work around certain applications and operating systems that expect different terminal behavior.
ug: مەزكۇر تاللانما بىر قىسىم پروگراممىلارغا تەسىر يەتكۈزۈشى مۇمكىن. بۇ تاللانمىلار باشقا تېرمىنال ياكى باشقا مەشغۇلاتلار سىستېمىلاردا نورمال ئىشلەشنى كۆزدە تۇتۇپلا بېكىتىلگەن.

source: These options only apply for BitTorrent
ug: بۇ تاللانمىلار بىتتوررېنتقىلا ئىشلەيدۇ

source: These shorthand commands take effect immediately: <D> inserts current date in local date format <T> inserts time and <DT> inserts date and time. These are converted only later when they are seen: <&Ynnnn> is translated to current year minus nnnn. (This can be used for example in birthday reminders to tell how old the person will be.)
ug: تۆۋەندىكى قىسقا بۇيرۇقلار شۇ ھامان ئىجرا بولىدۇ: <D> نۆۋەتتىكى ۋاقىت ۋە چېسلانى يەرلىك پىچىمدا قىستۇرىدۇ <T> ۋاقىتنى قىستۇرىدۇ <DT> ۋاقىت ۋە چېسلانى قىستۇرىدۇ. تۆۋەندىكىلەر بۇلار كۆرسىتىلگەندىلا ئايلاندۇرۇلىدۇ: <&Ynnnn> ھازىرقى يىلدىن nnnn نى ئالغان نەتىجىنى كۆرسىتىدۇ. (بۇنى ئادەتتە تۇغۇلغان كۈننى خەۋەر قىلغاندا، شۇ كىشىنىڭ قانچە ياشقا كىرگەنلىكىنى بىلدۈرۈشتە ئىشلەتسە بولىدۇ.)

source: Third quarter
ug: يېرىم ئاي

source: This action will delete the selected preset. Are you sure?
ug: بۇ مەشغۇلاتتا تاللانغان ئالدىن تەڭشەش ئۆچۈرۈلىدۇ. راستلا ئۆچۈرەمسىز؟

source: This application allows you to capture the entire screen, the active window or a selected region. You can set the delay that elapses before the screenshot is taken and the action to be performed afterwards: save the screenshot to a PNG file, copy it to the clipboard, open it using another application, or host it on <ulink type="http" url="http://www.zimagez.com">ZimageZ</ulink>, a free online image hosting service.
ug: بۇ پروگرامما ئارقىلىق پۈتۈن ئېكراننىڭ، ئاكتىپ كۆزنەكنىڭ ياكى تاللانغان دائىرىنىڭ كۆرۈنۈشىنى سۈرەتكە ئالغىلى بولىدۇ. ئېلىشنى باشلاشقىچە بولغان ۋاقىتنى بەلگىلەشكىمۇ بولىدۇ. تارتقان سۈرەتنى PNG ھۆججىتىگە ساقلاشقا، ساقلاش تاختىسىغا كۆچۈرۈشكە، ئۇنى باشقا پروگراممىدا ئېچىشقا ياكى تورىدىكى ھەقسىز سۈرەت ئېلان قىلىش مۇلازىمىتى بولغان <ulink type="http" url="http://www.zimagez.com">ZimageZ</ulink> دا ئېلان قىلىشقىمۇ بولىدۇ.

source: This appointment does not exist.
ug: بۇ دېيىشمە مەۋجۇت ئەمەس.

source: This appointment will be permanently removed.
ug: بۇ دېيىشمە مەڭگۈلۈككە ئۆچۈرۈلىدۇ.

source: This command will be executed after mounting the device with the mount point of the device as argument. If you are unsure what to insert, try "exo-open %m". '%d' can be used to specify the device, '%m' for the mountpoint.
ug: بۇ بۇيرۇق، پارامېتىردىكى ئېگەرلەش نۇقتىسىغا ئۈسكۈنە ئېگەرلەنگەندە ئىجرا بولىدۇ.\r نېمە كىرگۈزۈشنى بىلەلمىسىڭىز «exo-open %m» نى سىناپ بېقىڭ.\r ئۈسكۈنە ‹%d› بىلەن، ئېگەرلەش نۇقتىسى ‹%m› بىلەن ئىپادىلىنىدۇ.

source: This feature requires a file manager service to be present (such as the one supplied by Thunar).
ug: بۇنىڭ ئۈچۈن ھۆججەت باشقۇرغۇنىڭ مۇلازىمىتى زۆرۈردۇر(يەڭ سۇنار(Thunar) تەمىنلىگەن بىرەر مۇلازىمەت).

source: This feature requires a trash service to be present (such as the one supplied by Thunar).
ug: بۇنىڭ ئۈچۈن بىر ئەخلەتخانا مۇلازىمىتى بولۇشى كېرەك(سۇنار(Thunar) تەمىنلىگەندەك)

source: This file '%s' is executable. Do you want to execute it?
ug: بۇ ھۆججەت ‹%s› ئىجرا بولىدىكەن. ئۇنى ئىجرا قىلامسىز؟

source: This folder already contains a file "%s".
ug: مەزكۇر مۇندەرىجىدە ھۆججەت «%s» بار ئىكەن.

source: This folder already contains a folder "%s".
ug: قىسقۇچتا «%s» دېگەن قىسقۇچ بار

source: This folder already contains a symbolic link "%s".
ug: قىسقۇچتا بەلگىلىك(symbolic) ئۇلانما «%s» بار.
